src/main/java/com/amdocs/halo/automation/xmls/manageOrderRequestSG_NS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <ns0:manageOrderRequest xmlns="http://cio.att.com/entity/model" xmlns:ns0="http://cio.att.com/order/management/model" xmlns:ns2="http://cio.att.com/req/model" xmlns:ns1="http://cio.att.com/ord/model">
         <ns0:order>
            <ns2:eid>
               <context>OCX</context>
               <id>{$sorId$}</id>
               <entityType>SOR</entityType>
               <!--SOR,Solution-->
            </ns2:eid>
            <ns1:isBundle>true</ns1:isBundle>
            <ns1:subOrders>
               <ns1:item>
                  <ns2:eid>
                     <context>OCX</context>
                     <id>{$sgId$}</id><!--  Put SGID here-->
                     <entityType>Order</entityType>
                  </ns2:eid>
                  <ns2:type>DECOMPOSE</ns2:type>
                  <ns2:characteristics>
                     <item>
                        <name>ServiceGroupOrderId</name>
                        <value>{$sgId$}</value> <!--  Put SG here -->
                     </item>
                     <item>
                        <name>serviceGroupCounter</name>
                        <value>1</value>
                     </item>
                     <item>
                        <name>projectId</name>
                        <value>{$projId$}</value>
                     </item>
                  </ns2:characteristics>
                  <ns2:associations>
                     <item>
                        <associationName>associatedServiceOrder</associationName>
                        <items>
                           <item>
                              <context>OCX</context>
                              <id>{$oaId$}</id> <!--  Put Order Action here SG ID +1 -->
                              <entityType>OrderAction</entityType>
                              <type>MISS</type>
                              <product>MIS</product>
                           </item>
                        </items>
                     </item>
                <!-- <item>
                        <associationName>AssociatedServiceOrder</associationName>
                        <items>
                           <item>
                              <context>OCX</context>
                              <id>27272349</id>
                              <entityType>OrderAction</entityType>
                              <type>BVFLEX</type>
                              <product>IPFLEX</product>
                           </item>
                        </items>
                     </item> -->                  
                  </ns2:associations>
                  <ns1:isBundle>false</ns1:isBundle>
                  <ns1:actionType>PR</ns1:actionType>
                  <ns1:actionSubType>NA</ns1:actionSubType>
                  <ns1:version>1</ns1:version>
               </ns1:item>
            </ns1:subOrders>
         </ns0:order>
      </ns0:manageOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>